#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=49b948f6-0e15-411c-85a3-2f74d09ec9ca]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5bc2c783-550e-44e4-aabc-6834a4fe7ad2]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=79a42b03-858c-4a2d-9e58-76aafd24a876]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=37224ec3-26a4-4aae-affa-7464fe37be6c]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=343e1549-fbc8-4272-a082-874cdff61137]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=44f9174b-ac39-4ac7-9424-da7d29848674]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a961018f-0b8f-4b86-bf8d-e81e189c3818]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=864fd373-352b-46f0-be77-cb523b2d5bb1]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=251a9047-4924-4a03-8108-b738b841b93e]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f842a279-bbd9-4702-a80e-829dde93795f]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=32a65459-8143-4452-b2b9-20c09b3970f3]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c7e53d61-b2ac-4ff1-aac1-e1d6fb3ff292]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5ca5a527-eb46-4a87-8c2e-dec2a1ce581d]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfecb841-fc5a-4ada-95ee-7862304ed89a]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=69f112e8-3c0a-4130-b4cf-b0c99a01ba79]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=829ea884-556d-44dc-baaf-b3e019db8362]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8e25338-6994-4880-bc01-fba251d191dc]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d4c9ccda-5133-42bc-9449-4f5736003a49]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e805b4dd-b4c8-4f47-88a9-344077e3dc29]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a9609f3f-644f-4766-93b5-df0828e5cf06]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=36ab7946-6e84-4376-b7a4-03e3ebbcd084]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d589f6d5-ccd5-473d-af23-a0e3d66fc73f]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=856a2747-c51d-4a2c-9b52-1e6c460d4960]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=32e3e04f-1119-4b70-89f2-64f4cc7970af]
module.keycloak_prod.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=06319cc7-77a4-4ba3-9f15-dc9bcf7cfbe7]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=52b90c87-4a13-4eea-b8f3-37a9b0db4da9]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ebd48e30-dcfb-4a9e-8513-49e9eefad77d]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d3e3cedd-1f92-417d-93ab-19457df5f683]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8fc464a7-8cea-4f81-9dcd-f4a4e8279012]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=43fcee5c-a6d3-42ce-a969-627d672ada1c]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af41921b-b63f-42c2-8566-0287894b625b]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=aeef11d5-97d0-4f86-996e-47af535796a8]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d60fed94-d59d-4356-8e8f-0227b6093d86]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a7f0d4e5-9beb-4dbd-95fe-5764e81dd983]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b5d78f5-f3a4-403f-b113-7b44efc670f1]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=15395e35-9180-4fdd-9187-cd59ec234f35]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=abb77d0e-62b6-4373-b7b5-00572c676309]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1fcfe422-3e1d-4485-84d4-69c58b366852]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=794b1719-832a-45a8-9781-2020bc1331a2]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=31fe8470-428e-40a3-ad44-44ece7a3202b]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e4acccb2-a54f-466f-afd3-00242ea45591]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=61ed3d38-f426-4931-bb27-fa37dfb5865b]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1aa8c96a-e447-4a59-a34e-edda94216cbd]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bb08ebd-b4cb-4d44-b60c-0e21d419f6da]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3eed2f23-f733-496a-89e2-ef490e888f9c]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6f20e6c8-e6c4-43f9-a7c6-9d15ccc6788a]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1f9807e3-92d6-45b5-944d-85fbd4723bcc]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cbb41222-dcbc-4503-a86d-27a5d22bb19a]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2b5acd4e-a4ba-43c7-ab51-09f742ff313a]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6f4cd7b0-23a2-4d50-924d-5732b5e31198]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=22d2ffc0-450d-4538-a161-cbc18a7070b9]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=44bad374-783b-4082-b719-4fb0baa11833]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8a805fc-2b9b-403a-be71-8c398e41403b]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b1f0bc5e-7fd8-4bb5-b40f-ac951a36fa21]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7664b246-131a-4659-afb6-dd33d238f10b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fd79ab7-7443-4bb0-9f00-82357f01931d]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=784cb05b-c230-4fd8-96e2-dab84b0956a8]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7bf4efe9-0624-496b-9d8c-e38d59476a9b]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=60f5ccb2-08dd-4ce2-8647-a4f2204455dd]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d7c157f-0ad8-4b50-83ab-b9ea5a9e9ba7]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04c24d57-2ce2-4f79-8d82-44eaed51cde6]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e74c5ab8-83fe-41db-a7fb-e3287177ff21]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dd00c54f-d028-484a-ab89-06083e4a949f]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=99f9c885-065a-4ff4-94f5-db959a8a20eb]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a1046b2-f84f-478d-8660-daf21b43de9c]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=feb7c095-fc9f-4eeb-b78f-acc5e18bc299]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1063a59d-6c8c-4926-b66b-092fa4a9d848]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0d963ec-3ee4-48c8-b229-4c9d935cdbe3]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a5d6f95e-4b59-4757-8bd8-c30bc3bcece7]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8401602-f3aa-45e4-b092-bfb7601ff2d4]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a62d9bc7-b344-426d-a97f-df22a73eb9c2]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8971e002-cf5a-48ce-ba90-c7cde263d762]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=517b9d0b-d041-4a04-abd5-bd7cdbff9ce7]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=488ada4f-8162-4f45-9b4f-ac52b2ac380c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=619c7e73-594d-4e09-97da-bea8d65ec851]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d354c9f1-450b-44a5-ba23-83285dbe27b2]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e9ba6daf-6f2a-46b0-88d9-026c43dd202f]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a27f4065-200b-4278-898a-8e2f8e06f980]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ea117f1c-7eae-4a13-b0ed-7dfa0833b160]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=115d9565-9bd9-43ac-bc14-21b75f1e4731]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c620cb4-d71d-4493-8bd9-f56955df890a]
module.keycloak_prod.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7f7b6af7-8dd9-42e3-bd84-a876733826e4]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=529524ab-9b37-4a10-8e5d-9c794567c455]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa382880-a7c6-4f8d-ace8-62a6fa0af41b]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c6a20c6e-de11-409a-9070-b71d9a3bef96]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b146397-e5e7-4fd3-b4bb-e429bcdd71b7]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ceaff0b0-8c9f-4c41-a33b-c59a05a03e0b]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fc8bd481-284e-4433-97cf-1a2791cf4c16]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=98985797-5f1f-4d5e-89c5-158053344ddd]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a6ca6752-05da-45eb-aff5-0e2c1a3d6437]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3c388c82-b7dd-41c0-bd77-f62378d94fa4]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9498d40f-3cb2-4924-abb5-86ededda3cf3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4144e2d5-de81-40bb-b22f-b4465cfed586]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6c19e3da-fbc5-4036-b152-0c25654d4907]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9d04bdd-d48e-4960-a19c-5a7ead89a1e9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e6e4350-96c0-4ea4-b3d5-4593465d90aa]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7e37c2e2-3f69-4d96-b762-3e2495f6a27b]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c1f3ccfa-0f38-4f64-bbb6-181890ca3330]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fdea4659-f81b-4412-8790-d2a34fed0870]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7cb63b99-0fbd-4be1-b949-be9e39c8b8cb]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e2ff7649-8a81-47b9-a6f2-c4f6c5f15f83]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6947aa18-8f20-446c-91e8-29e522a1499a]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f810de6d-11ea-4e12-b8a2-cf49eac8f654]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3b65d4a9-0634-43c0-be7a-07b7b9729624]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f43f2e95-e301-498f-85ca-de90ca107cfe]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed47957-f9a3-4a80-aab0-01faf7cf36f3]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=40389902-ef71-4043-aadd-cfc47399b09b]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=00c5a938-c046-46fb-b8e2-6729f295995a]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=270baf74-dd24-4b11-b214-7f4c04fe8ef8]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=585de5c4-65d5-424b-9a9e-585809ee98e6]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=50578257-75bc-4965-9e24-146296065069]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5498eaa-0dce-45b5-b63e-91ddb252aed9]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=dfa84fd2-243a-43d6-921c-1e0adcbb615c]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5d646246-6d72-419f-8be5-cf5e570182c3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8b809df1-d101-4ec5-a51a-d6a7d316f1a3]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1b5de41d-015e-4d21-869e-b47e2644c181]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ba407409-b523-416b-b6a0-8d0352d596c9]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5da378b-e48d-4ab1-a388-34f453dda53c]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e88ab05a-bfc7-4914-9a3d-bb0aaaaaa170]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8bc4b3fa-b5ae-4522-b40b-716283547e38]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0d79542e-a556-4268-b2de-efb3ebeee884]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bc941fdc-36c6-41ca-a31f-0d5317066c0a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e5375a90-be56-4986-b3bb-e1977a0ad158]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0791fab7-a968-4a2e-beb6-3e26a7076af4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80231ac9-dfb3-40b4-a473-11f9730b9afe]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2491e226-7bee-491e-8fb9-f431a07a762e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4e64dfe-9cf3-41e0-807a-f33360e63bc9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5fd64e8a-138c-409a-8adf-fb7ec3893b0a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b09b865-d8b1-49c4-830f-3afc5bf696c9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=49f8b227-6f1b-4cae-b3e4-1e8f6f3da8f2]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3c98e029-5dc2-4536-8a1d-49a15749771e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=57c1ee94-f80f-436f-9885-613c2ec968dc]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e05a4562-037d-485d-9330-ccafb395ccd4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9de921f-2054-4a1b-b31a-d856e30904cf]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d74df522-b36e-4221-8e7c-c63e6f46671c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "1aa9624a-e83b-4abf-98a9-060a8e221893"
        name                                     = "test-3070"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "a2bd074a-a724-4823-ab31-7eb9d4355ae1"
        name                                     = "test-3070"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3169"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3169"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3169"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3169"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3169"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3169"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3169"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3169"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2936 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*